In [1]:
import pandas as pd
import numpy as np

In [13]:
df.groupby(['Segment', 'Category']).sum()

                               Row ID  Postal Code        Sales  Quantity  \
Segment     Category
Consumer    Furniture         5588575     62981731  391049.3120      4166
            Office Supplies  15337834    173024849  363952.1360     11758
            Technology        4654920     52872029  406399.8970      3597
Corporate   Furniture         3360455     34746521  229019.7858      2495
            Office Supplies   9283262     98400611  230676.4620      7018
            Technology        2861017     31389198  246450.1190      2095
Home Office Furniture         1744296     20467774  121930.6975      1367
            Office Supplies   5389439     59347412  124418.4340      4130
            Technology        1725217     18342527  183304.0170      1247

                             Discount      Profit
Segment     Category
Consumer    Furniture          196.71   6991.0786
            Office Supplies    496.40  56330.3210
            Technology         127.80  70797.8096
Corporate   Furniture          112.45   7584.8158
            Office Supplies    292.30  40227.3202
            Technology          73.10  44166.9980
Home Office Furniture           59.73   3875.3784
            Office Supplies    159.10  25933.1596
            Technology          43.50  30490.1405

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   datetime64[ns]
 3   Ship Date      9994 non-null   datetime64[ns]
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9994 non-null   object
 7   Segment        9994 non-null   object
 8   Country        9994 non-null   object
 9   City           9994 non-null   object
 10  State          9994 non-null   object
 11  Postal Code    9994 non-null   int64
 12  Region         9994 non-null   object
 13  Product ID     9994 non-null   object
 14  Category       9994 non-null   object
 15  Sub-Category   9994 non-null   object
 16  Product Name   9994 non-null   object
 17  Sales          9994 non-null   float64
 18  Quantity       9994 non-null   int64
 19  Discount       9994 non-null   float64
 20  Profit         9994 non-null   float64
dtypes: datetime64[ns](2), float64(3), int64(3), object(13)
memory usage: 1.6+ MB

In [24]:
df.groupby(df['Order Date'].dt.dayofweek)[['Profit', 'Sales']].mean()

               Profit       Sales
Order Date
0           27.531328  229.255914
1           32.161238  259.683094
2           39.633075  237.350337
3           27.124915  220.072302
4           25.589012  235.254268
5           24.941160  216.304944
6           33.409071  225.353127

In [25]:
df['Order Date'].dt.dayofweek

0       1
1       1
2       6
3       6
4       6
       ..
9989    1
9990    6
9991    6
9992    6
9993    3
Name: Order Date, Length: 9994, dtype: int64

In [32]:
df.resample('W', on='Order Date')['Sales'].mean()

Order Date
2014-01-05     64.808800
2014-01-12    287.473250
2014-01-19    204.960318
2014-01-26    132.496138
2014-02-02    149.300909
                 ...
2017-12-03    248.881308
2017-12-10    183.259221
2017-12-17    136.311208
2017-12-24    239.013778
2017-12-31    133.997490
Freq: W-SUN, Name: Sales, Length: 209, dtype: float64

In [29]:
df.groupby(df['Order Date'].dt.quarter)['Sales'].sum()

Order Date
1    359681.5758
2    445509.6196
3    613932.1057
4    878077.5592
Name: Sales, dtype: float64